cf/Enums/ВидКонтроляОстатков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.3">
	<Enum>
		<Properties>
			<Name>ВидКонтроляОстатков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаКонецМесяца</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаКонецДня</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/CommonModules/ОснПроцедурыИФ/Ext/Module.bsl
//Определеие КонтроляОстатков и вида контроля из Оранизации
Функция ПолучитьСтруктуруКонтоляОстатков(Организация,Дата) Экспорт 
	
	С = Новый Структура;
	
	Если Организация.КонтролироватьОстатки Тогда
		Если Организация.ВидКонтроляОстатков = Перечисления.ВидКонтроляОстатков.НаКонецДня Тогда
			С.Вставить("ДатаОстатков",?(ЗначениеЗаполнено(Дата),КонецДня(Дата),КонецДня(ТекущаяДата())));
			С.Вставить("ВидКонтроляОстатков",Организация.ВидКонтроляОстатков);
		ИначеЕсли Организация.ВидКонтроляОстатков = Перечисления.ВидКонтроляОстатков.НаКонецМесяца Тогда
			С.Вставить("ДатаОстатков",?(ЗначениеЗаполнено(Дата),КонецМесяца(Дата),КонецМесяца(ТекущаяДата())));
			С.Вставить("ВидКонтроляОстатков",Организация.ВидКонтроляОстатков);
		Иначе
			С.Вставить("ДатаОстатков",?(ЗначениеЗаполнено(Дата),КонецМесяца(Дата),КонецМесяца(ТекущаяДата())));
			С.Вставить("ВидКонтроляОстатков",Организация.ВидКонтроляОстатков);
		КонецЕсли;
	Иначе
		С.Вставить("ДатаОстатков",КонецМесяца(ТекущаяДата()));
		С.Вставить("ВидКонтроляОстатков",Неопределено);
	КонецЕсли; 
	
	Возврат С;

КонецФункции
